index=sysmon (sourcetype=WinEventLog:Security OR sourcetype=XmlWinEventLog:Security) 
EventCode=1 
New_Process_Name="*powershell.exe" 
CommandLine="*EncodedCommand*"
| table _time, ComputerName, New_Process_Name, CommandLine, Parent_Process_Name, Account_Name
