index=sysmon (sourcetype=WinEventLog:Security OR sourcetype=XmlWinEventLog:Security)
(EventCode=4688 OR EventCode=1) 
New_Process_Name="*rundll32.exe"
| eval suspicious=if(like(CommandLine,"%javascript%") OR like(CommandLine,"%mshtml%") OR like(CommandLine,"%shell32.dll%") OR like(CommandLine,"%.dll%"), "yes","no")
| search suspicious="yes"
| table _time, ComputerName, New_Process_Name, CommandLine, Parent_Process_Name, Account_Name
